isc-fs/stm32-can-bootloader/Core/Src/bl_obyte.c
/*
 * bl_obyte.c — option-byte read + WRP apply.
 *
 * Keeps all HAL option-byte knowledge in one file so the protocol
 * handlers can speak a clean bl_obyte API. Write-protection-on-launch
 * triggers a system reset, so bl_obyte_apply_wrp does not return on
 * success — callers must ACK beforehand.
 */

#include "bl_obyte.h"

#include "stm32h7xx_hal.h"

#include <string.h>


/* ---- Read ---- */

bl_ob_rc_t bl_obyte_read(bl_ob_status_t *out)
{
    memset(out, 0, sizeof(*out));

    FLASH_OBProgramInitTypeDef ob = { 0 };
    /* Tell the HAL which bank's WRP we want back. Single-bank part —
     * bank 1 only. */
    ob.Banks = FLASH_BANK_1;
    HAL_FLASHEx_OBGetConfig(&ob);

    out->wrp_sector_mask = ob.WRPSector;
    out->user_config     = ob.USERConfig;
    out->rdp_level       = (uint8_t)(ob.RDPLevel & 0xFFU);
    out->bor_level       = (uint8_t)(ob.BORLevel & 0xFFU);
    return BL_OB_OK;
}


/* ---- WRP query ---- */

bool bl_obyte_is_sector_wrp_protected(uint8_t sector)
{
    if (sector > 7U) {
        return false;
    }
    bl_ob_status_t st;
    if (bl_obyte_read(&st) != BL_OB_OK) {
        return false;
    }
    return (st.wrp_sector_mask & (1UL << sector)) != 0UL;
}


/* ---- Apply ---- */

bl_ob_rc_t bl_obyte_apply_wrp(uint32_t sector_bitmap)
{
    FLASH_OBProgramInitTypeDef ob = { 0 };
    ob.OptionType = OPTIONBYTE_WRP;
    ob.WRPState   = OB_WRPSTATE_ENABLE;
    ob.WRPSector  = sector_bitmap;
    ob.Banks      = FLASH_BANK_1;

    if (HAL_FLASH_Unlock() != HAL_OK) {
        return BL_OB_ERR_HARDWARE;
    }
    if (HAL_FLASH_OB_Unlock() != HAL_OK) {
        (void)HAL_FLASH_Lock();
        return BL_OB_ERR_HARDWARE;
    }

    HAL_StatusTypeDef st = HAL_FLASHEx_OBProgram(&ob);
    if (st != HAL_OK) {
        (void)HAL_FLASH_OB_Lock();
        (void)HAL_FLASH_Lock();
        return BL_OB_ERR_HARDWARE;
    }

    /* Launch writes the programmed bytes from the shadow area into the
     * active option-byte area and triggers a system reset. Execution
     * does not return on success. On the outside chance it ever does
     * (documented as "may fail silently on some families"), we fall
     * through and report HARDWARE. */
    (void)HAL_FLASH_OB_Launch();
    (void)HAL_FLASH_OB_Lock();
    (void)HAL_FLASH_Lock();
    return BL_OB_ERR_HARDWARE;
}
